# coding=utf-8
itemList = [{
    "type": "item",
    "物品名": "sunflowerseeds",
    "中文名": "生瓜子",
    "备注": "食用后回复0.5格（1点）饥饿值.",
    "最大堆叠": 64,
    "合成配方列表": [
        {  # 合成表1
            "key": {
                "A": {"id": "minecraft:double_plant", "data": 0},
            },
            "pattern": ["AA",
                        "  "],
            "type": "3x3",  # 合成所需格子2x2 或 3x3
            "合成输出个数": 1
        }
    ]
},
    {
        "type": "item",
        "物品名": "quern",
        "中文名": "手推石磨",
        "备注": "将手推石磨放到地上，然后右键出现GUI。左上放入原料，左下放入石质压力板，然后右边可以磨出一些新的食物。\n比如，小麦可以磨成面粉.5格（1点）饥饿值.",
        "最大堆叠": 64,
        "合成配方列表": [
            {  # 合成表1
                "key": {
                    "A": {"id": "minecraft:stick", "data": 0},
                    "B": {"id": "minecraft:stone", "data": 0},
                    "C": {"id": "minecraft:stone_pressure_plate", "data": 0}
                },
                "pattern": ["A  ",
                            "BCB",
                            "BCB"],
                "type": "3x3",  # 合成所需格子2x2 或 3x3
                "合成输出个数": 1
            }
        ]
    },
    {
        "type": "item",
        "物品名": "oven",
        "中文名": "烤炉",
        "备注": "将烤炉放到地上，然后右键出现GUI。左上放入生食物，左下放入食用油，然后右边可以出熟食。\n就是和原版熔炉一样的功能，但只能烧食物，速度快一点，燃料用的是食用油。",
        "最大堆叠": 64,
        "合成配方列表": [
            {  # 合成表1
                "key": {
                    "A": {"id": "minecraft:iron_ingot", "data": 0},
                    "B": {"id": "minecraft:iron_bars", "data": 0},
                    "C": {"id": "minecraft:furnace", "data": 0}
                },
                "pattern": ["ABA",
                            "ACA",
                            "AAA"],
                "type": "3x3",  # 合成所需格子2x2 或 3x3
                "合成输出个数": 1
            }
        ]
    },
    {
        "type": "item",
        "物品名": "churn",
        "中文名": "搅乳器",
        "备注": "将搅乳器放到地上，然后右键出现GUI。左上放入新鲜牛奶，左下放入盐，然后右边可以出黄油。",
        "最大堆叠": 64,
        "合成配方列表": [
            {  # 合成表1
                "key": {
                    "A": {"id": "minecraft:stick", "data": 0},
                    "B": {"id": "minecraft:planks", "data": 0}
                },
                "pattern": [" A ",
                            "BAB",
                            "BBB"],
                "type": "3x3",  # 合成所需格子2x2 或 3x3
                "合成输出个数": 1
            }
        ]
    },
    {
        "type": "item",
        "物品名": "queenbee",
        "中文名": "蜂后",
        "备注": "放入本模组蜂房中 会慢慢消耗自身耐久来产出蜂王浆 幼蜂或蜂巢\n耐久耗尽时会消失可以通过采集蜂巢方块(有几率获得)\n或者将幼蜂与蜂王浆合成得到",
        "最大堆叠": 1,
        "合成配方列表": [
            {  # 合成表1
                "key": {
                    "A": {"id": "royaljelly", "data": 0},
                    "B": {"id": "grub", "data": 0},
                },
                "pattern": ["AB",
                            "  "],
                "type": "3x3",  # 合成所需格子2x2 或 3x3
                "合成输出个数": 1
            }
        ]
    },
    {
        "type": "item",
        "物品名": "grub",
        "中文名": "蜜蜂幼虫",
        "备注": "将蜂后放入蜂房得到的产物之一\n可以与蜂王浆合成得到新的蜂后,在烹饪中可以替代部分需要肉类的配方",
        "最大堆叠": 64,
    },
    {
        "type": "item",
        "物品名": "royaljelly",
        "中文名": "蜂王浆",
        "备注": "可以与幼蜂合成蜂王,继续用于蜂巢产蜜\n无法食用",
        "最大堆叠": 64,
        "合成配方列表": [
            {  # 合成表1
                "key": {
                    "A": {"id": "queenbee", "data": 0},
                },
                "pattern": ["A ",
                            "  "],
                "type": "3x3",  # 合成所需格子2x2 或 3x3
                "合成输出个数": 1
            }
        ]
    },
    {
        "type": "item",
        "物品名": "cookedgrub",
        "中文名": "烤蜜蜂幼虫",
        "备注": "食用后回复2点饥饿值。",
        "最大堆叠": 64,
        "furnace": {  # 熔炉配方，如没有，则不写
            "input": {
                "输入物品id": "grub",
                "输入物品特殊值": 0,
                "输入物品个数": 1
            },
            "output": {
                "输出物品id": "cookedgrub",
                "输出物品特殊值": 0,
                "输出物品个数": 1
            }
        }
    },
]
