{
     
    "mwh_pam:sunflowerseeds":'''食用后回复0.5格（1点）饥饿值.'''
    , 
    "mwh_pam:quern":'''将手推石磨放到地上，然后右键出现GUI。左上放入原料，左下放入石质压力板，然后右边可以磨出一些新的食物。
比如，小麦可以磨成面粉.5格（1点）饥饿值.'''
    , 
    "mwh_pam:oven":'''将烤炉放到地上，然后右键出现GUI。左上放入生食物，左下放入食用油，然后右边可以出熟食。
就是和原版熔炉一样的功能，但只能烧食物，速度快一点，燃料用的是食用油。'''
    , 
    "mwh_pam:churn":'''将搅乳器放到地上，然后右键出现GUI。左上放入新鲜牛奶，左下放入盐，然后右边可以出黄油。'''
    , 
    "mwh_pam:queenbee":'''放入本模组蜂房中 会慢慢消耗自身耐久来产出蜂王浆 幼蜂或蜂巢
耐久耗尽时会消失可以通过采集蜂巢方块(有几率获得)
或者将幼蜂与蜂王浆合成得到'''
    , 
    "mwh_pam:grub":'''将蜂后放入蜂房得到的产物之一
可以与蜂王浆合成得到新的蜂后,在烹饪中可以替代部分需要肉类的配方'''
    , 
    "mwh_pam:royaljelly":'''可以与幼蜂合成蜂王,继续用于蜂巢产蜜
无法食用'''
    , 
    "mwh_pam:cookedgrub":'''食用后回复2点饥饿值。'''
    
}
        